<template>
<section class="about-us" id="about-us">
  <div class="au-container">
    <h2>ФИЛОСОФИЯ</h2>
    <p>{{ text }}</p>
  </div>
  <div class="au-line">
    <h3>О НАС</h3>
    <div class="line"></div>
  </div>
</section>
</template>

<script>
export default {
  name: "AboutUs",
  data() {
    return {
      text: "«Планета баскетбола» – это молодой баскетбольный проект, созданный для детей и родителей. Нашей главной целью является популяризация баскетбола и привитие интереса к физической культуре и спорту в целом. Мы не только обучаем детей игре, а в первую очередь стремимся всесторонне развивать личность каждого занимающегося, формируя жизненно важные качества.\n" +
        "\n" +
        "      Баскетбол – командная игра, и, работая в коллективе, ребёнок обретает такие навыки, как коммуникабельность; взаимоуважение и помощь партнерам; быстрое принятие решения; логическое, креативное и пространственное мышление; тренируемость и обучаемость; самоорганизация и тайм-менеджмент.\n" +
        "\n" +
        "      При участии в тренировочном процессе у ребёнка будут формироваться множество положительных качеств, например, трудолюбие, дисциплина, ответственность, лидерство, уверенность целеустремленность.\n" +
        "\n" +
        "      В «Планета баскетбола» созданы все условия для занятий данным видом спорта, начиная от инвентаря, методик тренировок и до получения каждым спортсменом должного внимания и поддержки от тренера. Также у нас проводятся мастер-классы, спортивные и вне тренировочных мероприятий, посредством которых дети и родители могут дополнительно общаться, проводить время за одним увлечением.",
    }
  }

}
</script>

<style scoped>

</style>
