<template>
  <section class="our-team" id="our-team">
    <div class="or-container">
      <ul class="couch-list">
        <li class="couch"
            v-for="(couch, id) in couchList"
            :key="`id_${id}`"
        >
          <h3>
            {{couch.shortName}}
          </h3>
          <img src="" alt="">
        </li>
      </ul>
      <div class="information">
        <img src="~/assets/image/icon-team2.svg" class="or-team-icon" alt="icon-team">
        <h3>Наша команда</h3>
        <p>{{description}}</p>
      </div>
    </div>
    <div class="or-line">
      <h3>Наша Команда</h3>
      <div class="line"></div>
    </div>
  </section>
</template>

<script>
export default {
  name: "OurTeam",
  data () {
    return {
      couchList:[
        {
          fullName:'БРЮТОВ ДМИТРИЙ',
          shortName:'ДМИТРИЙ',
          description:'главный тренер и один из основателей «Планеты Баскетбола», опытный игрок и профессионал своего дела',
          advanceList:[
            'Бакалавр и магистр по направлению «Физическая культура» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Обучался в аспирантуре по программе подготовки научно-педагогических кадров по направлению «Физическая культура и спорт» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            '1 взрослый разряд по баскетболу',
            '1 судейская категория Российской Федерации Баскетбола',
            'Чемпион Тюменской области Ассоциации студенческого баскетбола',
            'Главный тренер «Планеты баскетбола»',
            'Стаж тренерской деятельности 5 лет',
            'Организатор любительской баскетбольной лиги «Лига Планеты», г. Ханты-Мансийск'
  ]
        },
        {
          fullName:'АКСАРИН ИВАН',
          shortName:'ИВАН',
          description:'баскетбольный деятель, опытный игрок и тренер со стажем',
          advanceList:[
            'Магистр по направлению «Спорт» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Окончил аспирантуру по программе подготовки научно-педагогических кадров по направлению «Физическая культура и спорт» с присвоением квалификации «Исследователь. Преподаватель-исследователь» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Выпускник СДЮШОР имени ЗТР В.Н. Промина, г. Омск',
            'Кандидат в Мастера спорта России по баскетболу',
            'Чемпион УрФО Ассоциации студенческого баскетбола ',
            'Финалист Чемпионата России Ассоциации студенческого баскетбола',
            'Тренер мужской и женской баскетбольной команды ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск ',
            'Стаж тренерской деятельности 8 лет',
            'Баскетбольный деятель'
          ]
        },
        {
          fullName:'АКСАРИНА ЯНА',
          shortName:'ЯНА',
          description:'спортивный психолог, директор Академии Спорта, ст.преподаватель кафедры «Педагогики и психологии» ФГБОУ ВО ЮГУ, организатор и тренер фитнес-проекта Lady Fitness, баскетбольный деятель.',
          advanceList:[
            'Магистр по направлению «Спорт» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Окончила аспирантуру по программе подготовки научно-педагогических кадров по направлению «Педагогика и психология» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Профессиональная переподготовка по программе «Спортивная психология. Методики психологической помощи спортсменам» с присвоением квалификации «Спортивный психолог» АНО ДПО «Национальная академия дополнительного профессионального образования» г.Москва',
            'Повышение квалификации по направлению «Спортивный нутрициолог», «Диетологическое сопровождение клиента» Колледж бодибилдинга и фитнеса им.Бена Вейдера г.Москва',
            'Инструктор по направлению «Силовая тренировка» Профессиональная школа бодибилдинга и фитнеса г.Москва',
            '1 взрослый разряд по баскетболу и плаванию',
            'Призёр УрФО Ассоциации студенческого баскетбола среди женских команд',
            'Главный тренер женской баскетбольной команды ФГБОУ ВО «Югорский государственный университет», г.Ханты-Мансийск',
            'Стаж тренерской деятельности более 11 лет',
          ]
        },
        {
          fullName:'ШАБАНОВА ОКСАНА',
          shortName:'ОКСАНА',
          description:'помощник директора и администратор Планеты баскетбола, тренер и действующая баскетболистка БК «Север»',
          advanceList:[
           'Обучается в ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск по направлению «Физическая культура»',
            'Повышение квалификации по направлению «Спортивная диетология и нутрициология», Уральский институт повышения квалификации и переподготовки',
            'Бронзовый призер Тюменской области Ассоциации студенческого баскетбола',
            'Неоднократный победитель и MVP муниципального этапа регулярного чемпионата ШБЛ КЭС-баскет',
            'Игрок и капитан женской баскетбольной команды БК «Север» ФГБОУ ВО «Югорский государственный университет»',
            'Главный секретарь и судья ЛБЛ «Лига Планеты» г.Ханты-Мансийск',
            'Тренер и администратор «Планеты баскетбола»',
            'Стаж тренерской деятельности 2 года',
          ]
        }
      ],
      description:'Команда проекта «Планета баскетбола» – это коллектив единомышленников и ' +
        'профессионалов своего дела, которые нацелены на мотивацию людей к занятиями физической ' +
        'культурой и спортом посредством Баскетбола. Мы работаем с возрастным контингентом от 4 лет ' +
        'и до 60+ и считаем, что любой занимающийся достоин внимания и поддержки с нашей стороны.' +
        'Находясь под руководством такой команды, занимающиеся будут расти и развиваться крепкими,' +
        ' сильными и владеть своим телом, что актуально для данного вида спорта.\n' +
        'Тренерский состав грамотно уделяет внимание физической нагрузке в раннем возрасте, ' +
        'что обеспечивает полноценное развитие и благоприятное психоэмоциональное состояние. ' +
        'Занятия в «Планета Баскетбола» подготавливают ребенка к будущей деятельности.\n',
    }
  },
}
</script>
