<template>
  <section class="our-team" id="our-team">
    <div class="or-container">
      <ul class="couch-list">
        <li class="couch"
            v-for="(couch, id) in couchList"
            :key="`id_${id}`"
            @click="openModal(couch)"
        >
          <h3>{{couch.shortName}}</h3>
          <img src="" alt="">
        </li>
      </ul>
      <div class="information">
        <img src="~/assets/image/icon-team2.svg" class="or-team-icon" alt="icon-team">
        <h3>Наша команда</h3>
        <p>{{description}}</p>
      </div>
    </div>
    <div class="order">
      <h5 class="order-title">Первая тренировка бесплатно</h5>
      <div class="order-click" @click="openOrderWindow">
        <img src="~/assets/image/icons/icon-click.svg" alt="click" width="200" height="200">
      </div>
      <h5 class="order-title">вы можете записаться через :</h5>

      <div class="order-social-network-list">
        <div class="cube-dots">
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
        </div>
        <div class="order-social-network" >
          <a :href="icon_list[0].href">
            <svg class="order-icon" id="Bold" enable-background="new 0 0 24 24" height="512" viewBox="0 0 24 24" width="512" xmlns="http://www.w3.org/2000/svg"><path fill="000" d="m19.915 13.028c-.388-.49-.277-.708 0-1.146.005-.005 3.208-4.431 3.538-5.932l.002-.001c.164-.547 0-.949-.793-.949h-2.624c-.668 0-.976.345-1.141.731 0 0-1.336 3.198-3.226 5.271-.61.599-.892.791-1.225.791-.164 0-.419-.192-.419-.739v-5.105c0-.656-.187-.949-.74-.949h-4.126c-.419 0-.668.306-.668.591 0 .622.945.765 1.043 2.515v3.797c0 .832-.151.985-.486.985-.892 0-3.057-3.211-4.34-6.886-.259-.713-.512-1.001-1.185-1.001h-2.625c-.749 0-.9.345-.9.731 0 .682.892 4.073 4.148 8.553 2.17 3.058 5.226 4.715 8.006 4.715 1.671 0 1.875-.368 1.875-1.001 0-2.922-.151-3.198.686-3.198.388 0 1.056.192 2.616 1.667 1.783 1.749 2.076 2.532 3.074 2.532h2.624c.748 0 1.127-.368.909-1.094-.499-1.527-3.871-4.668-4.023-4.878z"/></svg>
          </a>
        </div>
        <div class="cube-dots">
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
        </div>

        <div class="order-social-network">
          <a :href="icon_list[1].href">
            <svg  class="order-icon" id="Layer_1" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px"
                 width="169.063px" height="169.063px" viewBox="0 0 169.063 169.063" style="enable-background:new 0 0 169.063 169.063;"
                 xml:space="preserve">
<g>
	<path d="M122.406,0H46.654C20.929,0,0,20.93,0,46.655v75.752c0,25.726,20.929,46.655,46.654,46.655h75.752
		c25.727,0,46.656-20.93,46.656-46.655V46.655C169.063,20.93,148.133,0,122.406,0z M154.063,122.407
		c0,17.455-14.201,31.655-31.656,31.655H46.654C29.2,154.063,15,139.862,15,122.407V46.655C15,29.201,29.2,15,46.654,15h75.752
		c17.455,0,31.656,14.201,31.656,31.655V122.407z"/>
  <path d="M84.531,40.97c-24.021,0-43.563,19.542-43.563,43.563c0,24.02,19.542,43.561,43.563,43.561s43.563-19.541,43.563-43.561
		C128.094,60.512,108.552,40.97,84.531,40.97z M84.531,113.093c-15.749,0-28.563-12.812-28.563-28.561
		c0-15.75,12.813-28.563,28.563-28.563s28.563,12.813,28.563,28.563C113.094,100.281,100.28,113.093,84.531,113.093z"/>
  <path d="M129.921,28.251c-2.89,0-5.729,1.17-7.77,3.22c-2.051,2.04-3.23,4.88-3.23,7.78c0,2.891,1.18,5.73,3.23,7.78
		c2.04,2.04,4.88,3.22,7.77,3.22c2.9,0,5.73-1.18,7.78-3.22c2.05-2.05,3.22-4.89,3.22-7.78c0-2.9-1.17-5.74-3.22-7.78
		C135.661,29.421,132.821,28.251,129.921,28.251z"/>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
              <g>
</g>
</svg>
          </a>
        </div>

        <div class="cube-dots">
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
          <div class="dot-sm"></div>
        </div>
      </div>
    </div>

    <div class="main-container main-container__long">
      <div class="left-title">Наша Команда</div>
      <div class="right-title">Записаться</div>
      <div class="line"></div>
    </div>
    <tm-modal :visible.sync="modal.show"  width="600" marginTop="100px">
      <template v-slot:body>
        <h3>Карточка тренера</h3>
        <div class="couch-container">
          <div class="main-description">
            <img src="" alt="Фото тренера" width="175" height="200">
            <div class="description">
              <div class="full-name">{{couch.fullName}}</div>
              <p v-html="couch.description"></p>
            </div>
          </div>
          <ul class="advance-list">
            <li class="advance-item" v-for="(advance, i) in couch.advanceList" :key="`i_${i}`">{{" "+advance}}</li>
          </ul>
        </div>
      </template>
      <template v-slot:footer>
        <button class="modal-button" @click="modal.show=false" :disabled="modal.loading">Закрыть</button>
      </template>
    </tm-modal>
    <tm-modal :visible.sync="modal.show_order"  width="600" marginTop="200px">
      <template v-slot:body>
        <h3>Запись в секцию </h3>
        <p>Запись через сайт временно не доступна</p>
      </template>
      <template v-slot:footer>
        <button class="modal-button" @click="modal.show_order=false" :disabled="modal.loading">Закрыть</button>
      </template>
    </tm-modal>
  </section>
</template>

<script>
import Modal from "~/components/Modal";
export default {
  name: "OurTeam",
  data () {
    return {
      icon_list:[
        {href:'https://vk.com/basketballplanet', src:'/instagram.svg', alt:'social network instagram'},
        {href:'https://www.instagram.com/basketball_planet86/', src:'/vk.svg', alt:'social network facebook'},
      ],
      modal:{
        show:false,
        show_order: false,
      },
      loading:false,
      couchList:[
        {
          fullName:'БРЮТОВ ДМИТРИЙ',
          shortName:'ДМИТРИЙ',
          description:'главный тренер и один из основателей «Планеты Баскетбола», опытный игрок и профессионал своего дела',
          advanceList:[
            'Бакалавр и магистр по направлению «Физическая культура» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Обучался в аспирантуре по программе подготовки научно-педагогических кадров по направлению «Физическая культура и спорт» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            '1 взрослый разряд по баскетболу',
            '1 судейская категория Российской Федерации Баскетбола',
            'Чемпион Тюменской области Ассоциации студенческого баскетбола',
            'Главный тренер «Планеты баскетбола»',
            'Стаж тренерской деятельности 5 лет',
            'Организатор любительской баскетбольной лиги «Лига Планеты», г. Ханты-Мансийск'
  ]
        },
        {
          fullName:'АКСАРИН ИВАН',
          shortName:'ИВАН',
          description:'баскетбольный деятель, опытный игрок и тренер со стажем',
          advanceList:[
            'Магистр по направлению «Спорт» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Окончил аспирантуру по программе подготовки научно-педагогических кадров по направлению «Физическая культура и спорт» с присвоением квалификации «Исследователь. Преподаватель-исследователь» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Выпускник СДЮШОР имени ЗТР В.Н. Промина, г. Омск',
            'Кандидат в Мастера спорта России по баскетболу',
            'Чемпион УрФО Ассоциации студенческого баскетбола ',
            'Финалист Чемпионата России Ассоциации студенческого баскетбола',
            'Тренер мужской и женской баскетбольной команды ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск ',
            'Стаж тренерской деятельности 8 лет',
            'Баскетбольный деятель'
          ]
        },
        {
          fullName:'АКСАРИНА ЯНА',
          shortName:'ЯНА',
          description:'спортивный психолог, директор Академии Спорта, ст.преподаватель кафедры «Педагогики и психологии» ФГБОУ ВО ЮГУ, организатор и тренер фитнес-проекта Lady Fitness, баскетбольный деятель.',
          advanceList:[
            'Магистр по направлению «Спорт» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Окончила аспирантуру по программе подготовки научно-педагогических кадров по направлению «Педагогика и психология» ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск',
            'Профессиональная переподготовка по программе «Спортивная психология. Методики психологической помощи спортсменам» с присвоением квалификации «Спортивный психолог» АНО ДПО «Национальная академия дополнительного профессионального образования» г.Москва',
            'Повышение квалификации по направлению «Спортивный нутрициолог», «Диетологическое сопровождение клиента» Колледж бодибилдинга и фитнеса им.Бена Вейдера г.Москва',
            'Инструктор по направлению «Силовая тренировка» Профессиональная школа бодибилдинга и фитнеса г.Москва',
            '1 взрослый разряд по баскетболу и плаванию',
            'Призёр УрФО Ассоциации студенческого баскетбола среди женских команд',
            'Главный тренер женской баскетбольной команды ФГБОУ ВО «Югорский государственный университет», г.Ханты-Мансийск',
            'Стаж тренерской деятельности более 11 лет',
          ]
        },
        // {
        //   fullName:'ШАБАНОВА ОКСАНА',
        //   shortName:'ОКСАНА',
        //   description:'помощник директора и администратор Планеты баскетбола, тренер и действующая баскетболистка БК «Север»',
        //   advanceList:[
        //    'Обучается в ФГБОУ ВО «Югорский государственный университет» г.Ханты-Мансийск по направлению «Физическая культура»',
        //     'Повышение квалификации по направлению «Спортивная диетология и нутрициология», Уральский институт повышения квалификации и переподготовки',
        //     'Бронзовый призер Тюменской области Ассоциации студенческого баскетбола',
        //     'Неоднократный победитель и MVP муниципального этапа регулярного чемпионата ШБЛ КЭС-баскет',
        //     'Игрок и капитан женской баскетбольной команды БК «Север» ФГБОУ ВО «Югорский государственный университет»',
        //     'Главный секретарь и судья ЛБЛ «Лига Планеты» г.Ханты-Мансийск',
        //     'Тренер и администратор «Планеты баскетбола»',
        //     'Стаж тренерской деятельности 2 года',
        //   ]
        // }
      ],
      description:'Команда проекта «Планета баскетбола» – это коллектив единомышленников и ' +
        'профессионалов своего дела, которые нацелены на мотивацию людей к занятиями физической ' +
        'культурой и спортом посредством Баскетбола. Мы работаем с возрастным контингентом от 4 лет ' +
        'и до 60+ и считаем, что любой занимающийся достоин внимания и поддержки с нашей стороны.' +
        'Находясь под руководством такой команды, занимающиеся будут расти и развиваться крепкими,' +
        ' сильными и владеть своим телом, что актуально для данного вида спорта.\n' +
        'Тренерский состав грамотно уделяет внимание физической нагрузке в раннем возрасте, ' +
        'что обеспечивает полноценное развитие и благоприятное психоэмоциональное состояние. ' +
        'Занятия в «Планета Баскетбола» подготавливают ребенка к будущей деятельности.\n',
    }
  },
  methods:{
    openModal(k){
      this.modal.show = true;
      this.couch = _.cloneDeep(k);
      this.errors = {};
    },
    openOrderWindow() {
      this.modal.show_order = true;

      console.log("log:modal");
    }
  },
  components: {
    'tm-modal':Modal
  }
}
</script>
